In [8]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_parquet("../data/RatingMatrix.parquet")
df.head()

    ship_to_id item_code  final_rating
0    EPM_34952     TCTLB           2.9
1    EPM_35444     TCTLB           2.7
2  EPM_3238950     TCTLB           1.9
3   EPM_136080     TCTLB           4.4
4  EPM_4393798     TCTLB           2.7

In [12]:
df["final_rating"] = df["final_rating"].apply(np.ceil).astype(int)

In [15]:
df.head()

    ship_to_id item_code  final_rating
0    EPM_34952     TCTLB             3
1    EPM_35444     TCTLB             3
2  EPM_3238950     TCTLB             2
3   EPM_136080     TCTLB             5
4  EPM_4393798     TCTLB             3

In [14]:
len(df)

69087

In [16]:
df["final_rating"].unique()

array([3, 2, 5, 4, 1])

In [17]:
from datetime import datetime

df['timestamp'] = pd.to_datetime(datetime.now())
df.head()

    ship_to_id item_code  final_rating                  timestamp
0    EPM_34952     TCTLB             3 2023-12-18 14:12:10.340268
1    EPM_35444     TCTLB             3 2023-12-18 14:12:10.340268
2  EPM_3238950     TCTLB             2 2023-12-18 14:12:10.340268
3   EPM_136080     TCTLB             5 2023-12-18 14:12:10.340268
4  EPM_4393798     TCTLB             3 2023-12-18 14:12:10.340268

In [18]:
df.tail(100)

        ship_to_id item_code  final_rating                  timestamp
71774    EPM_60781     T9005             2 2023-12-18 14:12:10.340268
71775    EPM_34985     T9005             5 2023-12-18 14:12:10.340268
71776  EPM_3503379     T9005             5 2023-12-18 14:12:10.340268
71777  EPM_4506054     T9005             2 2023-12-18 14:12:10.340268
71778    EPM_35210     T9005             2 2023-12-18 14:12:10.340268
...            ...       ...           ...                        ...
72107    EPM_35137     IT167             5 2023-12-18 14:12:10.340268
72108  EPM_1624002     IT167             2 2023-12-18 14:12:10.340268
72109  EPM_1966124     IT167             3 2023-12-18 14:12:10.340268
72110    EPM_34840     IT167             4 2023-12-18 14:12:10.340268
72111  EPM_3899821     IT167             3 2023-12-18 14:12:10.340268

[100 rows x 4 columns]

In [19]:
new_column_names = {
    'ship_to_id': 'user_id:token',
    'item_code': 'item_id:token',
    'final_rating': 'rating:float',
    'timestamp': 'timestamp:float',
}

# Renaming the columns
df.rename(columns=new_column_names, inplace=True)

In [20]:
df.head()

  user_id:token item_id:token  rating:float            timestamp:float
0     EPM_34952         TCTLB             3 2023-12-18 14:12:10.340268
1     EPM_35444         TCTLB             3 2023-12-18 14:12:10.340268
2   EPM_3238950         TCTLB             2 2023-12-18 14:12:10.340268
3    EPM_136080         TCTLB             5 2023-12-18 14:12:10.340268
4   EPM_4393798         TCTLB             3 2023-12-18 14:12:10.340268

In [21]:
test_df = df[df['item_id:token'] == 10137]
test_df

Empty DataFrame
Columns: [user_id:token, item_id:token, rating:float, timestamp:float]
Index: []

In [22]:
len(df)

69087

In [23]:
df.to_csv('epm.inter', index=False, sep='\t', mode='w')

# Break

In [7]:
df = pd.read_csv("data/rating_recommendation_CF_new.csv")
df.head()

   prod_id  ship_to_id_emos  final_rating_e       prod_name
0    10137          4089037               1  F. SEASON MDCT
1    10137          4374491               1  F. SEASON MDCT
2    10137          1839333               1  F. SEASON MDCT
3    10137          1759124               1  F. SEASON MDCT
4    10137          4236989               1  F. SEASON MDCT

In [8]:
unique_ids = df.groupby('prod_id')['prod_name'].unique()

# Convert the Series back to a DataFrame
unique_df = unique_ids.reset_index()
unique_df['Unique_Products'] = unique_df['prod_name'].apply(lambda x: ', '.join(x))
unique_df = unique_df.drop(columns=['prod_name'])


unique_df.columns = ['prod_id:token', 'prod_name:token']

In [9]:
unique_df.head()

   prod_id:token prod_name:token
0          10137  F. SEASON MDCT
1          10138  NFDEO RO BRIGH
2          10139  GLISODIN 30 KA
3          10140  ENTRAMIX COKLA
4          10141  DANCOW 1+ Madu

In [10]:
with open('emos.item', 'w') as f:
    f.write(unique_df.to_string(index=False))

In [35]:
df['ship_to_id_emos'].unique()

array([4089037, 4374491, 1839333, ..., 2267399,  560804, 4220865])

In [4]:
len(df)

123205

In [3]:
df.columns

Index(['barcode', 'prod_code', 'prod_name', 'kodesubdist', 'uom',
       'class_product', 'kode_prin', 'composition', 'package', 'kode_brand',
       'efficacy', 'category_product', 'idproduct', 'classification_product',
       'name_prin', 'name_brand'],
      dtype='object')

In [19]:
count = df['classification_product'].str.contains('-').sum()

In [20]:
count

91

In [2]:
df = pd.read_csv("data/collaborative_filtering.csv")
df.head()

   userId                                   movie  rating
0       1  One Flew Over the Cuckoo's Nest (1975)       5
1       1        James and the Giant Peach (1996)       3
2       1                     My Fair Lady (1964)       3
3       1                  Erin Brockovich (2000)       4
4       1                    Bug's Life, A (1998)       5